package loops;

public class LoopsA {
    public static void main(String[] args) {
        for (int con = 1000; con < 10000; con+=3){
            System.out.println(con);
        }
    }
}
//1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
