package loops;

public class LoopsB {
    public static void main(String[] args) {
        for (int i = 1, j = 0 ; j != 55 ; i+=2 , j++){
            System.out.println(i);
        }
    }
}

//2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….