package hwLessonLoops05;

public class Task01 {
    public static void main(String[] args) {
        /*
        Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
         */
        for (int i = 1000; i < 10000; i += 3) {
            System.out.println(i);
        }
    }
}
