package loops;

public class LoopsD {
    public static void main(String[] args) {
        for (int e = 2, r = 0 ; r != 20 ; e*=2 , r++) {
            System.out.println(e);
        }
    }
}

//4. Создайте программу, выводящую на экран первые 20 элементов последовательности 2 4 8 16 32 64 128 ….